<<<<<<< HEAD
function [B,DET,rphy]=generateBAD (psi,eta,XY)  %×ÜÖ®Éú³ÉBºÍĞĞÁĞÊ½,Õâ¸ö³ÌĞòÎÒ½«Òª´ó·¶Î§µÄĞŞ¸ÄÁË
=======
function [B,DET,rphy]=generateBAD (LX,LY,XY)  %×ÜÖ®Éú³ÉBºÍĞĞÁĞÊ½
>>>>>>> å¢æ·»äº†ä¸‰ç§è´¨é‡çŸ©é˜µç”Ÿæˆæ–¹å¼
%rphyÊÇÊäÈëµ±Ç°µÄpsiºÍetaÊä³ö°ë¾¶  
B = zeros(4,16);
global sdata;
nnode = sdata.NNODE; 
<<<<<<< HEAD
sumrow = sum(XY,2); %ÖĞ½é£¬ÎªÁË¼ÆËãÆ½¾ù°ë¾¶ÀûÓÃÒ»ÏÂ,ºóÃæ·¢ÏÖºÍabaqus½á¹ûÏà²îºÜ¶à£¬ËùÒÔÎÒ´òËã²»ÓÃÆ½¾ù°ë¾¶¼ÆËãÁË
rave = sumrow(1,1)/8;  %Öá¶Ô³Æµ¥Ôª±È½ÏÌØÊâ£¬ĞèÒªµ¥ÔªµÄÆ½¾ù°ë¾¶
	N(1) = 0.25*(1 - psi)*(1 - eta);
	N(2) = 0.25*(1 + psi)*(1 - eta);
	N(3) = 0.25*(1 + psi)*(1 + eta);
	N(4) = 0.25*(1 - psi)*(1 + eta);
	N(5) = 0.5*(1 - psi*psi)*(1 - eta); %½«CQ4ÔöÌí³ÉÁËCQ8
	N(6) = 0.5*(1 + psi)*(1 - eta*eta);
	N(7) = 0.5*(1 - psi*psi)*(1 + eta);
	N(8) = 0.5*(1 - psi)*(1 - eta*eta);
	N(1) = N(1) - 0.5*N(5) - 0.5*N(8);%¶ÔÔ­À´µÄ4¸öĞÎº¯Êı½øĞĞĞŞÕı
	N(2) = N(2) - 0.5*N(6) - 0.5*N(5);
	N(3) = N(3) - 0.5*N(7) - 0.5*N(6);
	N(4) = N(4) - 0.5*N(8) - 0.5*N(7);  %¼ì²éÁËNÃ»ÓĞÎÊÌâ£¬Ò»²¿·Ö³é²é
    
    N11 = 0.25*(1-eta)*(2*psi+eta);%1µ½4ºÅ½ÚµãÊÇ£¬×óÏÂ½Ç¿ªÊ¼ÄæÊ±ÕëÑ­»·£¬5-8ºÅÊÇ´Óµ×±ßµÄÖĞµã¿ªÊ¼ÄæÊ±ÕëÑ­»·
	N12 = 0.25*(1-eta)*(2*psi-eta);
	N13 = 0.25*(1+eta)*(2*psi+eta);
	N14 = 0.25*(1+eta)*(2*psi-eta);

	N15 = -psi*(1-eta);  %ÔöÌíÁËÆäÓà4¸ö½Úµã¶ÔpsiÇóµ¼
	N16 = 0.5*(1 - eta*eta);
	N17 = -psi*(1+eta);
	N18 = -0.5*(1 - eta*eta);

	N21 = 0.25*(1-psi)*(psi+2*eta);
	N22 = 0.25*(1+psi)*(-psi+2*eta);
	N23 = 0.25*(1+psi)*(psi+2*eta);
	N24 = 0.25*(1-psi)*(-psi+2*eta);

	N25 = -0.5*(1-psi*psi);  %ÔöÌíÁËÆäÓà4¸ö½Úµã¶ÔetaÇóµ¼
	N26 = -eta*(1+psi);
	N27 = 0.5*(1-psi*psi); 
	N28 = -eta*(1-psi);
%Éú³ÉµÈ²ÎÔªµÄĞÎº¯ÊıµÄµ¼Êı
Bpsi = [N11, N12, N13, N14, N15, N16, N17, N18;...
        N21, N22, N23, N24, N25, N26, N27, N28];
J = Bpsi*XY'; %Éú³ÉĞĞÁĞÊ½
DET=det(J);
Bphy = inv(J)* Bpsi ;  %Éú³ÉÎïÀí×ø±êµÄĞÎº¯ÊıµÄµ¼Êı  %¼ì²éÁËÏÂÃ»ÎÊÌâ
rphy = [N(1) N(2) N(3) N(4) N(5) N(6) N(7) N(8)]*XY(1,:)';
=======
N = sdata.N(:,LX,LY);
Bpsi = sdata.BN(:,:,LX,LY);
J = Bpsi*XY'; %Éú³ÉĞĞÁĞÊ½
DET=det(J);
Bphy = inv(J)* Bpsi ;  %Éú³ÉÎïÀí×ø±êµÄĞÎº¯ÊıµÄµ¼Êı  %¼ì²éÁËÏÂÃ»ÎÊÌâ
rphy = N'*XY(1,:)';
>>>>>>> å¢æ·»äº†ä¸‰ç§è´¨é‡çŸ©é˜µç”Ÿæˆæ–¹å¼

for i=1:nnode %Éú³ÉB
B(1, i*2-1) = Bphy(1, i);
B(2, i*2) = Bphy(2, i);  %¸ÄÁËÏÂ
B(3, i*2-1:i*2) = [Bphy(2, i),Bphy(1, i)];
B(4, i*2-1:i*2) = [N(i)/rphy, 0];
end  
end